In [98]:
import pandas as pd; import numpy as np; import janitor as jn; from pandas import Timedelta

In [99]:
df = pd.DataFrame(dict(A=[-1,0],
                       B=[1.0,0.0],
                       E=pd.to_datetime(['1969-12-31 23:59:59.999999999',
                          '1969-12-31 23:59:59.999999999']))
                          )
right=pd.DataFrame(dict(Floats=[-1.0,0.0],Integers=[1,0],Dates=pd.to_datetime(['1970-01-01','1970-01-01'])))

In [100]:
df

   A    B                             E
0 -1  1.0 1969-12-31 23:59:59.999999999
1  0  0.0 1969-12-31 23:59:59.999999999

In [101]:
right

   Floats  Integers      Dates
0    -1.0         1 1970-01-01
1     0.0         0 1970-01-01

In [102]:
(
        df[["B", "A", "E"]]
        .conditional_join(
            right[["Floats", "Integers", "Dates"]],
            ("B", "Floats", "<="),
            ("A", "Integers", "<"),
            ("E", "Dates", "<"),
            how="inner",
            keep="first",
            use_numba=True,
        )
 )

Empty DataFrame
Columns: [B, A, E, Floats, Integers, Dates]
Index: []

In [103]:
from string import ascii_lowercase
np.random.seed(1)
n = 20; k = 20
mapp = {k:v for v,k in enumerate(ascii_lowercase)}
idx1 = np.random.randint(0, high = 200, size = n)
idx2 = np.random.randint(0, high = 300, size = n)

d1 = dict(x = np.random.choice(list(ascii_lowercase[:5]), size=n),
          start = np.minimum(idx1, idx2),
          end = np.maximum(idx1, idx2),
          )


d2 = dict(x = np.random.choice(list(ascii_lowercase[:15]), size=k),
          pos1 = np.random.randint(low=60, high = 151, size=k))

d1 = pd.DataFrame(d1)
d2 = pd.DataFrame(d2)
d1 = d1.assign(xx=lambda df: df.x.map(mapp))
d2 = d2.assign(xx=lambda df: df.x.map(mapp))

In [104]:
bla = (d1
.conditional_join(
    d2, 
    ('start', 'pos1', '<'), 
    # ('end', 'pos1', '>'), 
    ('xx', 'xx', '=='), 
    use_numba=True)
)

bla

   left               right
      x start  end xx     x pos1 xx
0     d    68  140  3     d   81  3
1     d    68  140  3     d  137  3
2     a    79  141  0     a  135  0
3     a    79  141  0     a  137  0
4     d     7  192  3     d   81  3
5     d     7  192  3     d  137  3
6     c     1  129  2     c   66  2
7     a    71  209  0     a  135  0
8     a    71  209  0     a  137  0
9     c    20  115  2     c   66  2
10    a    30  146  0     a  135  0
11    a    30  146  0     a  137  0
12    d    49  156  3     d   81  3
13    d    49  156  3     d  137  3

In [105]:
d1

    x  start  end  xx
0   b     37   50   1
1   d     68  140   3
2   e     72  215   4
3   c    137  241   2
4   e     86  133   4
5   a     79  141   0
6   d      7  192   3
7   b     22  144   1
8   c      1  129   2
9   a     71  209   0
10  e    134  264   4
11  b     25  216   1
12  c    141  178   2
13  c     20  115   2
14  b    101  121   1
15  a     30  146   0
16  b     71  139   1
17  d     49  156   3
18  e      3  157   4
19  d    142  280   3

In [106]:
d1.merge(d2, on = 'xx').query('start < pos1')

   x_x  start  end  xx x_y  pos1
0    d     68  140   3   d   137
1    d     68  140   3   d    81
2    d      7  192   3   d   137
3    d      7  192   3   d    81
4    d     49  156   3   d   137
5    d     49  156   3   d    81
9    c      1  129   2   c    66
11   c     20  115   2   c    66
12   a     79  141   0   a   137
13   a     79  141   0   a   135
14   a     71  209   0   a   137
15   a     71  209   0   a   135
16   a     30  146   0   a   137
17   a     30  146   0   a   135

In [107]:
d1.merge(d2, on = 'xx').query('start < pos1 < end')

   x_x  start  end  xx x_y  pos1
0    d     68  140   3   d   137
1    d     68  140   3   d    81
2    d      7  192   3   d   137
3    d      7  192   3   d    81
4    d     49  156   3   d   137
5    d     49  156   3   d    81
9    c      1  129   2   c    66
11   c     20  115   2   c    66
12   a     79  141   0   a   137
13   a     79  141   0   a   135
14   a     71  209   0   a   137
15   a     71  209   0   a   135
16   a     30  146   0   a   137
17   a     30  146   0   a   135

In [108]:
d2

    x  pos1  xx
0   f   115   5
1   j   125   9
2   d   137   3
3   g    63   6
4   i    60   8
5   a   137   0
6   c    66   2
7   k   112  10
8   h   145   7
9   h   130   7
10  j    62   9
11  h   136   7
12  d    81   3
13  m   135  12
14  k    67  10
15  o   137  14
16  o   132  14
17  a   135   0
18  i   136   8
19  h   103   7

In [109]:
bla = (d1
.conditional_join(
    d2, 
    ('start', 'pos1', '<'), 
     ('end', 'pos1', '>'), 
    ('xx', 'xx', '=='), 
    use_numba=True)
)

bla

   left               right
      x start  end xx     x pos1 xx
0     d    68  140  3     d   81  3
1     d    68  140  3     d  137  3
2     a    79  141  0     a  135  0
3     a    79  141  0     a  137  0
4     d     7  192  3     d   81  3
5     d     7  192  3     d  137  3
6     c     1  129  2     c   66  2
7     a    71  209  0     a  135  0
8     a    71  209  0     a  137  0
9     c    20  115  2     c   66  2
10    a    30  146  0     a  135  0
11    a    30  146  0     a  137  0
12    d    49  156  3     d   81  3
13    d    49  156  3     d  137  3

In [110]:
(d1
.conditional_join(
    d2, 
    ('start', 'pos1', '>='), 
  #  ('end', 'pos1', '>='), 
    ('xx', 'xx', '<'), 
    use_numba=False)
)

   left               right
      x start  end xx     x pos1  xx
0     d    68  140  3     i   60   8
1     d    68  140  3     j   62   9
2     d    68  140  3     g   63   6
3     d    68  140  3     k   67  10
4     e    72  215  4     i   60   8
..  ...   ...  ... ..   ...  ...  ..
84    d   142  280  3     o  132  14
85    d   142  280  3     m  135  12
86    d   142  280  3     h  136   7
87    d   142  280  3     i  136   8
88    d   142  280  3     o  137  14

[89 rows x 7 columns]

In [111]:
# pprint([region_left, region_right, left_region, right_region])

In [112]:
df1 = pd.DataFrame({'id': [1,1,1,22,2,3], 
                    'value_1': [2,5,7,1,3,4]})
                    
df2 = pd.DataFrame({'id': [1,1,1,1,2,2,2,33], 
                    'value_2A': [0,3,7,12,0,2,3,1], 
                    'value_2B': [1,5,9,15,1,4,6,3]})

# df1 = pd.concat([df1]*2)
# df2 = pd.concat([df2]*2)
df1 = df1.sample(len(df1)).reset_index(drop=True)
df2 = df2.sample(len(df2)).reset_index(drop=True)

In [113]:
df1

   id  value_1
0   1        7
1   1        2
2   1        5
3  22        1
4   3        4
5   2        3

In [114]:
df2.sort_values(df2.columns.tolist())

   id  value_2A  value_2B
6   1         0         1
7   1         3         5
4   1         7         9
1   1        12        15
5   2         0         1
0   2         2         4
3   2         3         6
2  33         1         3

In [115]:
f=(df1
.conditional_join(
    df2,
    ('id', 'id', '=='),
    
    ('value_1', 'value_2B', '<='),
    ('value_1', 'value_2A', '=='),

    use_numba=True
))  
f

  left         right
    id value_1    id value_2A value_2B
0    1       7     1        7        9
1    2       3     2        3        6

In [116]:
df1

   id  value_1
0   1        7
1   1        2
2   1        5
3  22        1
4   3        4
5   2        3

In [117]:
df2

   id  value_2A  value_2B
0   2         2         4
1   1        12        15
2  33         1         3
3   2         3         6
4   1         7         9
5   2         0         1
6   1         0         1
7   1         3         5

In [118]:
# a,b=f
# pd.concat([df1.iloc[a].reset_index(drop=True),
#            df2.iloc[b].reset_index(drop=True)],
#            axis=1).select(columns=['value_1','value_2A','value_2B'])

In [119]:
df1.merge(df2, left_on=['id', 'value_1'], right_on=['id','value_2A'])

   id  value_1  value_2A  value_2B
0   1        7         7         9
1   2        3         3         6

In [120]:
df1.merge(df2, left_on=['id'], right_on=['id']).query('value_2A<value_1 and value_1>value_2B')

    id  value_1  value_2A  value_2B
2    1        7         0         1
3    1        7         3         5
6    1        2         0         1
10   1        5         0         1
14   2        3         0         1

In [121]:
df1.merge(df2, left_on=['id'], right_on=['id']).query('value_2A<value_1<=value_2B')

    id  value_1  value_2A  value_2B
11   1        5         3         5
12   2        3         2         4

In [122]:
df1

   id  value_1
0   1        7
1   1        2
2   1        5
3  22        1
4   3        4
5   2        3

In [123]:
df2

   id  value_2A  value_2B
0   2         2         4
1   1        12        15
2  33         1         3
3   2         3         6
4   1         7         9
5   2         0         1
6   1         0         1
7   1         3         5

In [124]:
# r=np.sort(np.column_stack(bla[0]),axis=0)
# r
# pd.Series(r[:,2]).is_monotonic_increasing

In [125]:
# df1 = pd.concat([df1]*2)
# df2 = pd.concat([df2]*2)

In [126]:
df2.sort_values(['value_2A','value_2B'],kind='stable')

   id  value_2A  value_2B
5   2         0         1
6   1         0         1
2  33         1         3
0   2         2         4
7   1         3         5
3   2         3         6
4   1         7         9
1   1        12        15

In [127]:
bla = (df1
.conditional_join(
    df2,
    # ('id', 'id', '>'),
     ('value_1', 'value_2A', '>='),
    ('value_1', 'value_2B', '<='),
    use_numba=True
))

bla

   left         right
     id value_1    id value_2A value_2B
0     1       7     1        7        9
1     1       2     2        2        4
2     1       2    33        1        3
3     1       5     1        3        5
4     1       5     2        3        6
5    22       1    33        1        3
6    22       1     1        0        1
7    22       1     2        0        1
8     3       4     1        3        5
9     3       4     2        3        6
10    3       4     2        2        4
11    2       3     1        3        5
12    2       3     2        3        6
13    2       3     2        2        4
14    2       3    33        1        3

In [128]:
# %%timeit
# (df1
# .conditional_join(
#     df2,
#     # ('id', 'id', '>'),
#     # ('value_1', 'value_2A', '>='),
#     ('value_1', 'value_2B', '<='),
#     use_numba=True
# ))

In [129]:
# %%timeit
# (df1
# .conditional_join(
#     df2,
#     # ('id', 'id', '>'),
#     # ('value_1', 'value_2A', '>='),
#     ('value_1', 'value_2B', '<='),
#     use_numba=False
# ))

In [130]:
(df1
.conditional_join(
    df2,
    # ('id', 'id', '>'),
     ('value_1', 'value_2A', '>='),
    ('value_1', 'value_2B', '<='),
    use_numba=False
))

   left         right
     id value_1    id value_2A value_2B
0     1       7     1        7        9
1     1       2    33        1        3
2     1       2     2        2        4
3     1       5     2        3        6
4     1       5     1        3        5
5    22       1     2        0        1
6    22       1     1        0        1
7    22       1    33        1        3
8     3       4     2        2        4
9     3       4     2        3        6
10    3       4     1        3        5
11    2       3    33        1        3
12    2       3     2        2        4
13    2       3     2        3        6
14    2       3     1        3        5

In [131]:
url='/Users/samuel.oranyeli/events.csv'
#url = 'https://raw.githubusercontent.com/samukweku/data-wrangling-blog/master/notebooks/Data_files/results.csv'
events = pd.read_csv(url, parse_dates=['start', 'end'])
events.head()

   id     name  audience               start     sponsor                 end
0   1  Event 1      1178 2022-11-19 10:00:00   Sponsor 2 2022-11-19 10:15:00
1   2  Event 2      1446 2015-09-27 15:00:00  Sponsor 11 2015-09-27 15:11:00
2   3  Event 3      2261 2019-11-12 18:00:00  Sponsor 10 2019-11-12 18:53:00
3   4  Event 4      1471 2019-12-24 22:00:00   Sponsor 6 2019-12-24 22:11:00
4   5  Event 5      2605 2028-06-20 12:00:00   Sponsor 8 2028-06-20 12:31:00

In [132]:
bla =(events
.conditional_join(
    events,
    ('start', 'end', '<='),
    ('end', 'start', '>='),
    ('id', 'id', '!='),
    # ('audience','audience','>'),
    use_numba = True,
    df_columns = ['id', 'start', 'end'],
    right_columns = ['id', 'start', 'end'])
)

bla

       left                                          right  \
         id               start                 end     id
0        10 1993-11-27 12:00:00 1993-11-27 12:37:00   2345
1        15 1993-04-04 16:00:00 1993-04-04 18:00:00  11178
2        17 2030-10-25 07:00:00 2030-10-25 07:27:00  19605
3        26 2005-10-04 17:00:00 2005-10-04 17:18:00   8218
4        35 2024-05-02 15:00:00 2024-05-02 15:35:00  27696
...     ...                 ...                 ...    ...
3697  29966 2000-08-26 11:00:00 2000-08-26 13:00:00  29375
3698  29971 2018-05-18 04:00:00 2018-05-18 04:18:00  24173
3699  29978 1992-06-07 22:00:00 1992-06-07 22:23:00    981
3700  29984 2025-06-05 03:00:00 2025-06-05 03:17:00  19051
3701  29995 2016-09-04 14:00:00 2016-09-04 14:32:00  12296


                   start                 end
0    1993-11-27 10:00:00 1993-11-27 12:00:00
1    1993-04-04 17:00:00 1993-04-04 17:22:00
2    2030-10-25 06:00:00 2030-10-25 08:00:00
3    2005-10-04 17:00:00 2005-10-04 17:27:00
4    2024-05-02 15:00:00 2024-05-02 15:07:00
...                  ...                 ...
3697 2000-08-26 13:00:00 2000-08-26 13:53:00
3698 2018-05-18 04:00:00 2018-05-18 04:36:00
3699 1992-06-07 22:00:00 1992-06-07 22:30:00
3700 2025-06-05 01:00:00 2025-06-05 03:00:00
3701 2016-09-04 14:00:00 2016-09-04 14:50:00

[3702 rows x 6 columns]

In [133]:
# r=np.sort(np.column_stack(bla[0]),axis=0)
# r
# pd.Series(r[:,1]).is_monotonic_increasing

In [134]:
events.shape[0]**2

899940001

In [135]:
# %%timeit
# (events
# .conditional_join(
#     events,
#     ('start', 'end', '<='),
#     ('end', 'start', '>='),
#     ('id', 'id', '!='),
#     use_numba = True,
#     df_columns = ['id', 'start', 'end'],
#     right_columns = ['id', 'start', 'end'])
# )

In [136]:
# %%timeit
# (events
# .conditional_join(
#     events,
#     ('start', 'end', '<='),
#     ('end', 'start', '>='),
#     ('id', 'id', '!='),
#     use_numba = False,
#     df_columns = ['id', 'start', 'end'],
#     right_columns = ['id', 'start', 'end'])
# )

In [137]:
(events
.conditional_join(
    events,
    ('start', 'end', '<='),
    ('end', 'start', '>='),
    ('id', 'id', '!='),
    use_numba = False,
    df_columns = ['id', 'start', 'end'],
    right_columns = ['id', 'start', 'end'])
)

       left                                          right  \
         id               start                 end     id
0        10 1993-11-27 12:00:00 1993-11-27 12:37:00   2345
1        15 1993-04-04 16:00:00 1993-04-04 18:00:00  11178
2        17 2030-10-25 07:00:00 2030-10-25 07:27:00  19605
3        26 2005-10-04 17:00:00 2005-10-04 17:18:00   8218
4        35 2024-05-02 15:00:00 2024-05-02 15:35:00   6916
...     ...                 ...                 ...    ...
3697  29966 2000-08-26 11:00:00 2000-08-26 13:00:00  29375
3698  29971 2018-05-18 04:00:00 2018-05-18 04:18:00  24173
3699  29978 1992-06-07 22:00:00 1992-06-07 22:23:00    981
3700  29984 2025-06-05 03:00:00 2025-06-05 03:17:00  19051
3701  29995 2016-09-04 14:00:00 2016-09-04 14:32:00  12296


                   start                 end
0    1993-11-27 10:00:00 1993-11-27 12:00:00
1    1993-04-04 17:00:00 1993-04-04 17:22:00
2    2030-10-25 06:00:00 2030-10-25 08:00:00
3    2005-10-04 17:00:00 2005-10-04 17:27:00
4    2024-05-02 15:00:00 2024-05-02 15:36:00
...                  ...                 ...
3697 2000-08-26 13:00:00 2000-08-26 13:53:00
3698 2018-05-18 04:00:00 2018-05-18 04:36:00
3699 1992-06-07 22:00:00 1992-06-07 22:30:00
3700 2025-06-05 01:00:00 2025-06-05 03:00:00
3701 2016-09-04 14:00:00 2016-09-04 14:50:00

[3702 rows x 6 columns]

In [138]:
C=dict(key=[f"c{num}" for num in range(1,8)],
       vol=[35,15,5,35,18,90,17],
       profit=[45,35,55,12,15,55,11],
       unitsSold=[15,10,30,10,15,80,2],
       keyy = range(1,8)
       )
C=pd.DataFrame(C)


D=dict(key=[f'd{num}' for num in range(1,9)],
       vol=[20,50,15,16,40,20,40,2],
       profit=[30,10,12,52,35,20,30,57],
       unitsSold=[20,35,10,12,40,30,5,15],
       keyy=range(8,0,-1)
       )
D=pd.DataFrame(D)

In [139]:
C.merge(D, on='keyy').query('profit_x>=profit_y and unitsSold_x>=unitsSold_y and vol_x<=vol_y')

,key_x,vol_x,profit_x,unitsSold_x,keyy,key_y,vol_y,profit_y,unitsSold_y
1,c2,15,35,10,2,d7,40,30,5
2,c3,5,55,30,3,d6,20,20,30

In [167]:
# C = pd.concat([C]*40)
# D = pd.concat([D]*40)

In [141]:
f=(C
.conditional_join(
    D, 
    
    ('profit','profit','>='),
    ('keyy','keyy','=='),
   ('unitsSold','unitsSold','>='),
  ('vol','vol','<='),
  # ('vol','profit','>'),
    use_numba=True)
)
f

  left                           right
   key vol profit unitsSold keyy   key vol profit unitsSold keyy
0   c2  15     35        10    2    d7  40     30         5    2
1   c3   5     55        30    3    d6  20     20        30    3

In [142]:
C.iloc[[1,2]], D.iloc[[6,5]]

(  key  vol  profit  unitsSold  keyy
 1  c2   15      35         10     2
 2  c3    5      55         30     3,
   key  vol  profit  unitsSold  keyy
 6  d7   40      30          5     2
 5  d6   20      20         30     3)

In [143]:
f=(C
.conditional_join(
    D, 
    ('vol','vol','<'),
    ('profit','profit','>'),
 # ('unitsSold','unitsSold','<'),
 # ('vol','profit','>'),
    use_numba=True)
)
f

   left                           right
    key vol profit unitsSold keyy   key vol profit unitsSold keyy
0    c1  35     45        15    1    d5  40     35        40    4
1    c1  35     45        15    1    d7  40     30         5    2
2    c1  35     45        15    1    d2  50     10        35    7
3    c2  15     35        10    2    d1  20     30        20    8
4    c2  15     35        10    2    d6  20     20        30    3
5    c2  15     35        10    2    d7  40     30         5    2
6    c2  15     35        10    2    d2  50     10        35    7
7    c3   5     55        30    3    d3  15     12        10    6
8    c3   5     55        30    3    d4  16     52        12    5
9    c3   5     55        30    3    d1  20     30        20    8
10   c3   5     55        30    3    d6  20     20        30    3
11   c3   5     55        30    3    d5  40     35        40    4
12   c3   5     55        30    3    d7  40     30         5    2
13   c3   5     55        30    3    d2  50     10        35    7
14   c4  35     12        10    4    d2  50     10        35    7
15   c5  18     15        15    5    d2  50     10        35    7
16   c7  17     11         2    7    d2  50     10        35    7

In [144]:
(C
.conditional_join(
    D, 
    ('vol','vol','<'),
    ('profit','profit','>'),
 # ('unitsSold','unitsSold','<'),
 # ('vol','profit','>'),
    use_numba=False)
)

   left                           right
    key vol profit unitsSold keyy   key vol profit unitsSold keyy
0    c1  35     45        15    1    d2  50     10        35    7
1    c1  35     45        15    1    d7  40     30         5    2
2    c1  35     45        15    1    d5  40     35        40    4
3    c2  15     35        10    2    d2  50     10        35    7
4    c2  15     35        10    2    d6  20     20        30    3
5    c2  15     35        10    2    d1  20     30        20    8
6    c2  15     35        10    2    d7  40     30         5    2
7    c3   5     55        30    3    d2  50     10        35    7
8    c3   5     55        30    3    d3  15     12        10    6
9    c3   5     55        30    3    d6  20     20        30    3
10   c3   5     55        30    3    d1  20     30        20    8
11   c3   5     55        30    3    d7  40     30         5    2
12   c3   5     55        30    3    d5  40     35        40    4
13   c3   5     55        30    3    d4  16     52        12    5
14   c4  35     12        10    4    d2  50     10        35    7
15   c5  18     15        15    5    d2  50     10        35    7
16   c7  17     11         2    7    d2  50     10        35    7

In [145]:
f=(C
.conditional_join(
    D, 
    ('vol','vol','<'),
    ('profit','profit','>'),
  ('unitsSold','unitsSold','<'),
  ('vol','profit','>'),
    use_numba=True)
)
f

  left                           right
   key vol profit unitsSold keyy   key vol profit unitsSold keyy
0   c1  35     45        15    1    d2  50     10        35    7
1   c2  15     35        10    2    d2  50     10        35    7
2   c4  35     12        10    4    d2  50     10        35    7
3   c5  18     15        15    5    d2  50     10        35    7
4   c7  17     11         2    7    d2  50     10        35    7

In [146]:
C.shape[0] * D.shape[0]

56

In [147]:
(C
.conditional_join(
    D, 
    ('vol','vol','<'),
    ('profit','profit','>'),
  #  ('unitsSold','unitsSold','<'),
    use_numba=False)
)

   left                           right
    key vol profit unitsSold keyy   key vol profit unitsSold keyy
0    c1  35     45        15    1    d2  50     10        35    7
1    c1  35     45        15    1    d7  40     30         5    2
2    c1  35     45        15    1    d5  40     35        40    4
3    c2  15     35        10    2    d2  50     10        35    7
4    c2  15     35        10    2    d6  20     20        30    3
5    c2  15     35        10    2    d1  20     30        20    8
6    c2  15     35        10    2    d7  40     30         5    2
7    c3   5     55        30    3    d2  50     10        35    7
8    c3   5     55        30    3    d3  15     12        10    6
9    c3   5     55        30    3    d6  20     20        30    3
10   c3   5     55        30    3    d1  20     30        20    8
11   c3   5     55        30    3    d7  40     30         5    2
12   c3   5     55        30    3    d5  40     35        40    4
13   c3   5     55        30    3    d4  16     52        12    5
14   c4  35     12        10    4    d2  50     10        35    7
15   c5  18     15        15    5    d2  50     10        35    7
16   c7  17     11         2    7    d2  50     10        35    7

In [148]:
(C
.conditional_join(
    D, 
    ('vol','vol','<'),
    ('profit','profit','>'),
    ('unitsSold','unitsSold','<'),
    use_numba=False)
)

  left                           right
   key vol profit unitsSold keyy   key vol profit unitsSold keyy
0   c1  35     45        15    1    d2  50     10        35    7
1   c1  35     45        15    1    d5  40     35        40    4
2   c2  15     35        10    2    d2  50     10        35    7
3   c2  15     35        10    2    d6  20     20        30    3
4   c2  15     35        10    2    d1  20     30        20    8
5   c3   5     55        30    3    d2  50     10        35    7
6   c3   5     55        30    3    d5  40     35        40    4
7   c4  35     12        10    4    d2  50     10        35    7
8   c5  18     15        15    5    d2  50     10        35    7
9   c7  17     11         2    7    d2  50     10        35    7

In [149]:
(C
.conditional_join(
    D, 
    ('vol','vol','<'),
    ('profit','profit','>'),
  ('unitsSold','unitsSold','<'),
  ('vol','profit','>'),
    use_numba=False)
)

  left                           right
   key vol profit unitsSold keyy   key vol profit unitsSold keyy
0   c1  35     45        15    1    d2  50     10        35    7
1   c2  15     35        10    2    d2  50     10        35    7
2   c4  35     12        10    4    d2  50     10        35    7
3   c5  18     15        15    5    d2  50     10        35    7
4   c7  17     11         2    7    d2  50     10        35    7

In [168]:
%%timeit
(C
.conditional_join(
    D, 
    ('vol','vol','<'),
    ('profit','profit','>'),
    ('unitsSold','unitsSold','<'),
    use_numba=True)
)

526 ms ± 4.68 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)

In [169]:
%%timeit
(C
.conditional_join(
    D, 
    ('vol','vol','<'),
    ('profit','profit','>'),
    ('unitsSold','unitsSold','<'),
    use_numba=False)
)

1.14 s ± 6.4 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)

In [152]:
D

  key  vol  profit  unitsSold  keyy
0  d1   20      30         20     8
1  d2   50      10         35     7
2  d3   15      12         10     6
3  d4   16      52         12     5
4  d5   40      35         40     4
5  d6   20      20         30     3
6  d7   40      30          5     2
7  d8    2      57         15     1

In [153]:
C.sort_values('vol')

  key  vol  profit  unitsSold  keyy
2  c3    5      55         30     3
1  c2   15      35         10     2
6  c7   17      11          2     7
4  c5   18      15         15     5
0  c1   35      45         15     1
3  c4   35      12         10     4
5  c6   90      55         80     6

In [154]:
D.sort_values('vol')
#D.sort_values('profit')
#D.sort_values('profit',ascending=False)

  key  vol  profit  unitsSold  keyy
7  d8    2      57         15     1
2  d3   15      12         10     6
3  d4   16      52         12     5
0  d1   20      30         20     8
5  d6   20      20         30     3
4  d5   40      35         40     4
6  d7   40      30          5     2
1  d2   50      10         35     7

In [155]:
D

  key  vol  profit  unitsSold  keyy
0  d1   20      30         20     8
1  d2   50      10         35     7
2  d3   15      12         10     6
3  d4   16      52         12     5
4  d5   40      35         40     4
5  d6   20      20         30     3
6  d7   40      30          5     2
7  d8    2      57         15     1

In [156]:
C.sort_values('vol')

  key  vol  profit  unitsSold  keyy
2  c3    5      55         30     3
1  c2   15      35         10     2
6  c7   17      11          2     7
4  c5   18      15         15     5
0  c1   35      45         15     1
3  c4   35      12         10     4
5  c6   90      55         80     6

In [157]:
D.sort_values('vol')

  key  vol  profit  unitsSold  keyy
7  d8    2      57         15     1
2  d3   15      12         10     6
3  d4   16      52         12     5
0  d1   20      30         20     8
5  d6   20      20         30     3
4  d5   40      35         40     4
6  d7   40      30          5     2
1  d2   50      10         35     7

In [158]:
pd.concat([C.loc[:, ['key','vol']], D.loc[:, ['key','vol']]]).sort_values('vol',kind='stable')

  key  vol
7  d8    2
2  c3    5
1  c2   15
2  d3   15
3  d4   16
6  c7   17
4  c5   18
0  d1   20
5  d6   20
0  c1   35
3  c4   35
4  d5   40
6  d7   40
1  d2   50
5  c6   90

In [159]:
C.sort_values('profit',ascending=False)

  key  vol  profit  unitsSold  keyy
2  c3    5      55         30     3
5  c6   90      55         80     6
0  c1   35      45         15     1
1  c2   15      35         10     2
4  c5   18      15         15     5
3  c4   35      12         10     4
6  c7   17      11          2     7

In [160]:
D.sort_values('profit',ascending=False)

  key  vol  profit  unitsSold  keyy
7  d8    2      57         15     1
3  d4   16      52         12     5
4  d5   40      35         40     4
0  d1   20      30         20     8
6  d7   40      30          5     2
5  d6   20      20         30     3
2  d3   15      12         10     6
1  d2   50      10         35     7

In [161]:
C.vol.sort_values()

2     5
1    15
6    17
4    18
0    35
3    35
5    90
Name: vol, dtype: int64

In [162]:
C.vol.sort_values().searchsorted(D.vol, side='left')

array([4, 6, 1, 2, 6, 4, 6, 0])

In [163]:
C.sort_values(['vol','profit', 'unitsSold'])

  key  vol  profit  unitsSold  keyy
2  c3    5      55         30     3
1  c2   15      35         10     2
6  c7   17      11          2     7
4  c5   18      15         15     5
3  c4   35      12         10     4
0  c1   35      45         15     1
5  c6   90      55         80     6